In [33]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [34]:
orders = pd.read_excel(r"d:\Users\HP\Desktop\Siddhant Jain\ALabs\Internship Screening Case Study\Internship Screening Case Study.xlsx",
                  sheet_name = "Orders Data",
                  header= 0,
                  parse_dates=['ORDER_DATE'])
orders.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS
0,O100000,C100000,85.00,0.0,2016-05-18,Delivered,ON-TIME
1,O100001,C100001,307.52,0.0,2016-05-18,Delivered,ON-TIME
2,O100002,C100002,0.00,0.0,2016-05-18,Delivered,ON-TIME
3,O100003,C100003,153.73,0.0,2016-05-18,Delivered,ON-TIME
4,O100004,C100004,-39.55,0.0,2016-05-18,Delivered,ON-TIME

In [35]:
customer = pd.read_excel(r"d:\Users\HP\Desktop\Siddhant Jain\ALabs\Internship Screening Case Study\Internship Screening Case Study.xlsx",
                  sheet_name = "Customer Data",
                  header= 0)
customer.head()

,CUSTOMER_ID,CUSTOMER_KEY,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
0,1,C100000,9693593216,N,M,Chennai,APP
1,2,C100001,9770151476,Y,M,Bangalore,WEBSITE
2,3,C100002,9779085726,N,M,Gurgaon,WEBSITE
3,4,C100003,9298611643,N,M,Gurgaon,APP
4,5,C100004,9929250328,Y,M,Chennai,APP

In [36]:
## Combining the datasets on CUSTOMER_KEY

df = orders.merge(customer, how = 'outer', on = 'CUSTOMER_KEY')
df.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
0,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,1.0,9.693593e+09,N,M,Chennai,APP
1,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,11.0,9.693593e+09,N,F,Gurgaon,WEBSITE
2,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,18.0,9.693593e+09,N,F,Chennai,WEBSITE
3,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,26.0,9.693593e+09,N,M,Others,WEBSITE
4,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,6018.0,9.693593e+09,N,M,Gurgaon,WEBSITE

### Q1. Total Revenue, total orders by each location

In [37]:
df.groupby(['Location']).agg(Total_Revenue = ('ORDER_TOTAL','sum'),Total_orders = ('ORDER_NUMBER','count'))

           Total_Revenue  Total_orders
Location
Bangalore   2.649581e+07         34598
Chennai     4.863785e+07         62898
Gurgaon     5.405135e+07         68826
Others      5.848670e+06          7326

### Q2. Total revenue, total orders by customer gender

In [38]:
df.groupby(['Gender']).agg(Total_Revenue = ('ORDER_TOTAL','sum'),Total_orders = ('ORDER_NUMBER','count'))

        Total_Revenue  Total_orders
Gender
F        4.016046e+07         51748
M        9.487323e+07        121900

### Q3. Which location of customers cancelling orders maximum?

In [39]:
df[df['ORDER_STATUS'] == 'Cancelled'].groupby(['Location'])[['ORDER_STATUS']].count().sort_values(by='ORDER_STATUS',ascending=False).head(1)

          ORDER_STATUS
Location
Gurgaon            476

### Q4. Total customers, Revenue, Orders by each Acquisition channel

In [40]:
df.groupby(['Acquired Channel']).agg(Total_customers = ('CUSTOMER_KEY','count'),Total_Revenue = ('ORDER_TOTAL','sum'),Total_orders = ('ORDER_NUMBER','count'))

                  Total_customers  Total_Revenue  Total_orders
Acquired Channel
APP                         68281   5.344572e+07         68277
WEBSITE                    105376   8.158797e+07        105371

### Q5. Which acquisition channel is good interms of revenue generation, maximum orders, repeat purchasers?

In [50]:
df.groupby(['Acquired Channel']).agg(Total_Revenue = ('ORDER_TOTAL','sum'),Total_orders = ('ORDER_NUMBER','count'), Repeat_purchasers = ('CUSTOMER_KEY','count') )

                  Total_Revenue  Total_orders  Repeat_purchasers
Acquired Channel
APP                5.344572e+07         68277              68281
WEBSITE            8.158797e+07        105371             105376

### Q6. Write User Defined Function which can take input data set which create two data sets with numerical variables and categorical variables separately

In [67]:
def categorical(x,y):
    data_com = data_1.merge(data_2, how = 'outer', on = 'CUSTOMER_KEY')
    
    data_numerical = data_com.select_dtypes(include=['float64','datetime64[ns]'])
    data_categorical = data_com.select_dtypes(include='object')
    
    return [data_numerical.head(), data_categorical.head()]

In [68]:
data_1 = pd.read_excel(r"d:\Users\HP\Desktop\Siddhant Jain\ALabs\Internship Screening Case Study\Internship Screening Case Study.xlsx",
                  sheet_name = "Orders Data",
                  header= 0,
                  parse_dates=['ORDER_DATE'])
data_2 = pd.read_excel(r"d:\Users\HP\Desktop\Siddhant Jain\ALabs\Internship Screening Case Study\Internship Screening Case Study.xlsx",
                  sheet_name = "Customer Data",
                  header= 0)



categorical(data_1,data_2)

[   ORDER_TOTAL  DISCOUNT ORDER_DATE  CUSTOMER_ID  CONTACT_NUMBER
 0         85.0       0.0 2016-05-18          1.0    9.693593e+09
 1         85.0       0.0 2016-05-18         11.0    9.693593e+09
 2         85.0       0.0 2016-05-18         18.0    9.693593e+09
 3         85.0       0.0 2016-05-18         26.0    9.693593e+09
 4         85.0       0.0 2016-05-18       6018.0    9.693593e+09,
   ORDER_NUMBER CUSTOMER_KEY ORDER_STATUS DELIVERY_STATUS  \
 0      O100000      C100000    Delivered         ON-TIME
 1      O100000      C100000    Delivered         ON-TIME
 2      O100000      C100000    Delivered         ON-TIME
 3      O100000      C100000    Delivered         ON-TIME
 4      O100000      C100000    Delivered         ON-TIME

   Referred Other customers Gender Location Acquired Channel
 0                        N      M  Chennai              APP
 1                        N      F  Gurgaon          WEBSITE
 2                        N      F  Chennai          WEBSITE
 3                        N      M   Others          WEBSITE
 4                        N      M  Gurgaon          WEBSITE  ]

### Q7. Write User Defined Function which can take input as any variable and output as follows. Test them on different columns

### a. For categorical variables, the output will be number of distinct categories with frequency, number of missings, percentage of missings

### b. For numerical variables, the output will be no.of missings, percentage of missings, minimum, maximum, sum, mean, median, variance, Coeficient of variation, 25th Percentile and 75th Percentile values

In [83]:
def read(x):
     if x in df.columns:
            if isinstance(x, float):
                return x.describe()
            else:  return x.isnull().sum()

In [84]:
df['ORDER_NUMBER'].apply(read)

0         None
1         None
2         None
3         None
4         None
          ...
173661    None
173662    None
173663    None
173664    None
173665    None
Name: ORDER_NUMBER, Length: 173666, dtype: object